ERP.belugaerp/src/InformationRegisters/бг_ПротоколыЗагрузкиПеремещенийПоЗаданиямSolvo/бг_ПротоколыЗагрузкиПеремещенийПоЗаданиямSolvo.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>бг_ПротоколыЗагрузкиПеремещенийПоЗаданиямSolvo</name>
  <attributes>
    <name>ПротоколЗагрузкиИзSolvo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПеремещениеТоваров</name>
    <type>
      <types>DocumentRef.ПеремещениеТоваров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/InformationRegisters/бг_ПротоколыЗагрузкиПеремещенийПоЗаданиямSolvo/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Дополняет текст протокола загрузки перемещения товаров.
//
// Параметры:
//  ПеремещениеТоваров - Документссылка.ПремещениеТоваров  - ссылка на перемещение товаров.
//  ТекстПротокола     - Строка - текст протокола, который надо добавить.
//
Процедура ДополнитьПротоколЗагрузки(ПеремещениеТоваров, ТекстПротокола) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не ЗначениеЗаполнено(ПеремещениеТоваров) Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.бг_ПротоколыЗагрузкиПеремещенийПоЗаданиямSolvo.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПеремещениеТоваров.Установить(ПеремещениеТоваров);
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() > 0 Тогда
		Запись = НаборЗаписей[0];
	Иначе
		Запись = НаборЗаписей.Добавить();
		Запись.ПеремещениеТоваров = ПеремещениеТоваров;
	КонецЕсли;
	
	Запись.ПротоколЗагрузкиИзSolvo = 
		Запись.ПротоколЗагрузкиИзSolvo
		+ ?(ЗначениеЗаполнено(Запись.ПротоколЗагрузкиИзSolvo), Символы.ПС, "")
		+ ТекстПротокола;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
